[
  {
    "id": "I001",
    "priority": 1,
    "category": "foundation",
    "description": "Create reproducible multi-environment infrastructure baseline for dev, stage, and prod",
    "steps": [
      "Define environment variable contract and sample files",
      "Define local and shared runtime topology",
      "Verify all required services can start from a clean machine"
    ],
    "passes": true,
    "evidence": "Ran scripts/bootstrap_dev.ps1; .env created; topology and compose files validated.",
    "updated_at": "2026-02-27T05:42:55Z",
    "notes": "Acceptance: documented startup works end-to-end in dev. Dependencies: none. Repo: polaris-mall-infra."
  },
  {
    "id": "I002",
    "priority": 2,
    "category": "data",
    "description": "Provide database provisioning and migration baseline with rollback support",
    "steps": [
      "Create initial schema migration pipeline",
      "Add rollback plan for the latest migration",
      "Validate migration execution in a disposable environment"
    ],
    "passes": true,
    "notes": "包含 0001/0002 迁移与对应 down 文件，支持 schema_migrations 记录与最新版本回退。",
    "evidence": "已实现版本化迁移与最近一次回滚，执行 migrate_validate_dev.ps1 通过（迁移->回滚->重放）。",
    "updated_at": "2026-02-27T08:51:34Z"
  },
  {
    "id": "I003",
    "priority": 3,
    "category": "network",
    "description": "Set up API gateway and service routing for web-to-api and callback traffic",
    "steps": [
      "Define route map for user and admin APIs",
      "Add auth header forwarding and timeout policies",
      "Validate payment callback ingress route"
    ],
    "passes": false,
    "notes": "Acceptance: routing rules direct requests to correct upstreams. Dependencies: I001. Repo: polaris-mall-infra."
  },
  {
    "id": "I004",
    "priority": 4,
    "category": "async",
    "description": "Establish message queue topics and worker runtime for order and payment events",
    "steps": [
      "Define event topic naming and retention policy",
      "Provision queue or stream runtime in non-prod",
      "Publish and consume a sample order event"
    ],
    "passes": false,
    "notes": "Acceptance: at-least-one event flow validated. Dependencies: I001. Repo: polaris-mall-infra."
  },
  {
    "id": "I005",
    "priority": 5,
    "category": "delivery",
    "description": "Implement CI or CD pipeline with build, test, and deploy gates for all repos",
    "steps": [
      "Define pipeline stages and required checks",
      "Enforce branch protection gates",
      "Run deployment to dev environment from main branch"
    ],
    "passes": false,
    "notes": "Acceptance: failed tests block deployment. Dependencies: I001, I002, I003. Repo: polaris-mall-infra."
  },
  {
    "id": "I006",
    "priority": 6,
    "category": "observability",
    "description": "Add shared logging, metrics, tracing, and alerting baseline",
    "steps": [
      "Define log format and correlation id propagation",
      "Expose service metrics and dashboard",
      "Create alert rule for critical checkout failures"
    ],
    "passes": false,
    "notes": "Acceptance: one dashboard and one critical alert are working. Dependencies: I003. Repo: polaris-mall-infra."
  },
  {
    "id": "I007",
    "priority": 7,
    "category": "security",
    "description": "Set up secret handling, least-privilege access, and baseline security checks",
    "steps": [
      "Store credentials in managed secret source",
      "Limit runtime permissions by environment role",
      "Add dependency and container vulnerability scan"
    ],
    "passes": false,
    "notes": "Acceptance: no plaintext production credential in repo or logs. Dependencies: I001, I005. Repo: polaris-mall-infra."
  },
  {
    "id": "I008",
    "priority": 8,
    "category": "reliability",
    "description": "Prepare backup, restore, and rollback runbook for critical data and releases",
    "steps": [
      "Define backup schedule and retention policy",
      "Test point-in-time restore in stage",
      "Document release rollback and ownership model"
    ],
    "passes": false,
    "notes": "Acceptance: restore drill is executed and documented. Dependencies: I002, I005. Repo: polaris-mall-infra."
  }
]
